#საბტაიპების სია დინამიურად უნდა ამოვიღოთ ListSubtypes-ს საშუალებით
subtype_list = {0: 'არხის მშენებლობა',
                1: 'კაბელის მონტაჟი',
                2: 'P2P ინსტალაცია',
                3: 'კარადის მონტაჟი',
                4: 'ბოძის მონტაჟი',
                5: 'ქურო',
                6: 'ODF-ი',
                7: 'ჭის მონტაჟი',
                8: 'სპლიტერი'}

#ეს სია უნდა შეიქმნას სამუშაოების ცხრილიდან დინამიურად:
domain_list = {
        "არხის მშენებლობა": {
                            1314 : "გოფრირებული მილი 25მმ",
                            1307 : "ქვიშის ბალიშის მოწყობა (#PX0.35X0.1)",
                            1310 : "გოფრირებულdsdsი მილი 25მმ",
                            1301 : "ქვიშის ბdsdsალიშის მოწყობა (#PX0.35X0.1)"
                            },
        "კაბელის მონტაჟი" : {
                            2363 : "კაბელი/ტპპ/7/4/მეორადი-ის დემონტაჟი",
                            2394 : "კაბელი ოპტიკური/ADSS/12-ის მონტაჟი ტრანზიტულად"
                            },
        "P2P ინსტალაცია": {
                            1253 : "როუტერი/D-Link/4port/Dir100/Router-ის მონტაჟი",
                            1285 : "ONT/GPON/4 port/HG850a/HUAWEI მონტაჟი"
                            },
        "კარადის მონტაჟი": {
                            1160 : "გამანაწილებელი კარადა 600X2-ის მონტაჟი",
                            1122 : "GPON-ის სასადგურე კარადის მონტაჟი FIST-GR3-900-1"
                            },
        "ბოძის მონტაჟი":  {
                             2007 : "ბოძი/ძირითადი/8.1მ-ის მონტაჟი",
                             2206 : "ბოძი/ხის/მეორადი"
                            },
        "ქურო":          {
                            2346 : "ქუროს სამონტაჟო კომპლექტი/FOSC-A/B-UNI-MOUNT-A-ის მონტაჟი",
                            2076 : "ქურო გამანაწილებელი/500/2-600/2/6 თითიანი/6MRP 5/6-ის მონტაჟი"
                            },
        "ODF-ი":          {
                            1314 : "გოფრირებული მილი 25მმ",
                            1307 : "ქვიშის ბალიშის მოწყობა (#PX0.35X0.1)"
                            },
        "ჭის მონტაჟი":   {
                            1314 : "გოფრირებული მილი 25მმ",
                            1307 : "ქვიშის ბალიშის მოწყობა (#PX0.35X0.1)"
                            },
        "სპლიტერი":     {
                            1677 : "ოპტიკური სპლიტერი/PLC/1:4/კონექტორის გარეშე -  მონტაჟი",
                            1683 : "ოპტიკური სპლიტერი/PLC/1:8/SC/PC/კასეტით -  მონტაჟი "
                            }
        }
